podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/TSI0_MK10DZ10.svd.xml
            <register>
               <name>SCANC</name>
               <description>SCAN Control Register</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>AMPSC</name>
                     <description>Active Mode Prescaler\n
Input Clock Source division factor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000</name>
                           <description>Divided by 1</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001</name>
                           <description>Divided by 2</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010</name>
                           <description>Divided by 4</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011</name>
                           <description>Divided by 8</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100</name>
                           <description>Divided by 16</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101</name>
                           <description>Divided by 32</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b110</name>
                           <description>Divided by 64</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b111</name>
                           <description>Divided by 128</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AMCLKS</name>
                     <description>Active Mode Clock Source</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Bus Clock</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>MCGIRCLK</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>OSCERCLK</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Not valid</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AMCLKDIV</name>
                     <description>Active mode clock divider</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Divider set to 1</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Divider set to 2048</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SMOD</name>
                     <description>Scan Modulus</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00000000</name>
                           <description>Continuous Scan</description>
                           <value>0b00000000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0bXXXXXXXX</name>
                           <description>Scan Period Modulo</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DELVOL</name>
                     <description>Delta voltage select applied to analog oscillators</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bXXX</name>
                           <description>(N+1)x100 mV delta voltage</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EXTCHRG</name>
                     <description>External oscillator charge current select</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bXXXX</name>
                           <description>(N+1) uA Charge current</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CAPTRM</name>
                     <description>Internal capacitance trim value</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bXXX</name>
                           <description>(N+5)x0.5pF reference capacitance</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="EXTCHRG" > <name>REFCHRG</name> <description>Ref OSC Charge Current select</description> <bitOffset>27</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PEN</name>
               <description>Pin Enable Register</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>PEN0</name>
                     <description>Pin 0 enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Pin disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Pin enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="PEN0" > <name>PEN1</name> <description>Pin 1 enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN2</name> <description>Pin 2 enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN3</name> <description>Pin 3 enable</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN4</name> <description>Pin 4 enable</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN5</name> <description>Pin 5 enable</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN6</name> <description>Pin 6 enable</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN7</name> <description>Pin 7 enable</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN8</name> <description>Pin 8 enable</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN9</name> <description>Pin 9 enable</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN10</name> <description>Pin 10 enable</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN11</name> <description>Pin 11 enable</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN12</name> <description>Pin 12 enable</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN13</name> <description>Pin 13 enable</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN14</name> <description>Pin 14 enable</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN15</name> <description>Pin 15 enable</description> <bitOffset>15</bitOffset> </field>
                  <field>
                     <name>LPSP</name>
                     <description>Low-Power Scan Pin\n
Selects which input is active in low-power mode</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bXXXX</name>
                           <description>Active pin number</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Status Register</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>ORNGF0</name>
                     <description>Touch Sensing Electrode Out-of-Range Flag 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>In range</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Out of range</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ORNGF0" > <name>ORNGF1</name> <description>Touch Sensing Electrode Out-of-Range Flag 1</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="ORNGF0" > <name>ORNGF2</name> <description>Touch Sensing Electrode Out-of-Range Flag 2</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="ORNGF0" > <name>ORNGF3</name> <description>Touch Sensing Electrode Out-of-Range Flag 3</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="ORNGF0" > <name>ORNGF4</name> <description>Touch Sensing Electrode Out-of-Range Flag 4</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="ORNGF0" > <name>ORNGF5</name> <description>Touch Sensing Electrode Out-of-Range Flag 5</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="ORNGF0" > <name>ORNGF6</name> <description>Touch Sensing Electrode Out-of-Range Flag 6</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="ORNGF0" > <name>ORNGF7</name> <description>Touch Sensing Electrode Out-of-Range Flag 7</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="ORNGF0" > <name>ORNGF8</name> <description>Touch Sensing Electrode Out-of-Range Flag 8</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="ORNGF0" > <name>ORNGF9</name> <description>Touch Sensing Electrode Out-of-Range Flag 9</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="ORNGF0" > <name>ORNGF10</name> <description>Touch Sensing Electrode Out-of-Range Flag 10</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="ORNGF0" > <name>ORNGF11</name> <description>Touch Sensing Electrode Out-of-Range Flag 11</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="ORNGF0" > <name>ORNGF12</name> <description>Touch Sensing Electrode Out-of-Range Flag 12</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="ORNGF0" > <name>ORNGF13</name> <description>Touch Sensing Electrode Out-of-Range Flag 13</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="ORNGF0" > <name>ORNGF14</name> <description>Touch Sensing Electrode Out-of-Range Flag 14</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="ORNGF0" > <name>ORNGF15</name> <description>Touch Sensing Electrode Out-of-Range Flag 15</description> <bitOffset>15</bitOffset> </field>
                  <field>
                     <name>ERROF0</name>
                     <description>TouchSensing Error Flag 0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No Error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Error</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ERROF0" > <name>ERROF1</name> <description>TouchSensing Error Flag  1</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="ERROF0" > <name>ERROF2</name> <description>TouchSensing Error Flag  2</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="ERROF0" > <name>ERROF3</name> <description>TouchSensing Error Flag  3</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="ERROF0" > <name>ERROF4</name> <description>TouchSensing Error Flag  4</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="ERROF0" > <name>ERROF5</name> <description>TouchSensing Error Flag  5</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="ERROF0" > <name>ERROF6</name> <description>TouchSensing Error Flag  6</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="ERROF0" > <name>ERROF7</name> <description>TouchSensing Error Flag  7</description> <bitOffset>23</bitOffset> </field>
                  <field derivedFrom="ERROF0" > <name>ERROF8</name> <description>TouchSensing Error Flag  8</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="ERROF0" > <name>ERROF9</name> <description>TouchSensing Error Flag  9</description> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="ERROF0" > <name>ERROF10</name> <description>TouchSensing Error Flag  10</description> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="ERROF0" > <name>ERROF11</name> <description>TouchSensing Error Flag  11</description> <bitOffset>27</bitOffset> </field>
                  <field derivedFrom="ERROF0" > <name>ERROF12</name> <description>TouchSensing Error Flag  12</description> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="ERROF0" > <name>ERROF13</name> <description>TouchSensing Error Flag  13</description> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="ERROF0" > <name>ERROF14</name> <description>TouchSensing Error Flag  14</description> <bitOffset>30</bitOffset> </field>
                  <field derivedFrom="ERROF0" > <name>ERROF15</name> <description>TouchSensing Error Flag  15</description> <bitOffset>31</bitOffset> </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>1,3,5,7,9,11,13,15</dimIndex>
               <name>CNTR%s</name>
               <description>Counter Register %s</description>
               <addressOffset>0x100</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CTN1</name>
                     <description>Touch Sensing Channel %s-1 16-bit Counter Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>CTN</name>
                     <description>Touch Sensing Channel %s 16-bit Counter Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>THRESHLD%s</name>
               <description>Channel %s Threshold Register</description>
               <addressOffset>0x120</addressOffset>
               <fields>
                  <field>
                     <name>HTHH</name>
                     <description>High Threshold Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>LTHH</name>
                     <description>Low Threshold Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
